tap "discoteq/discoteq"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "libtiff"
brew "little-cms2"
brew "jpeg-xl"
brew "aom"
brew "aspell"
brew "bartib"
brew "black"
brew "boost"
brew "glib"
brew "cairo"
brew "check"
brew "cmake"
brew "cmocka"
brew "cppcheck"
brew "deno"
brew "libevent"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "eza"
brew "gmp"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "python@3.12"
brew "libass"
brew "libssh"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fltk"
brew "mpfr"
brew "gawk"
brew "isl"
brew "libmpc"
brew "gcc"
brew "gh"
brew "git"
brew "gitleaks"
brew "go"
brew "gperftools"
brew "lcov"
brew "libavif"
brew "librsvg"
brew "llvm"
brew "mypy"
brew "nasm"
brew "neovim"
brew "ninja"
brew "node"
brew "openblas"
brew "openjdk@17"
brew "openssl@1.1"
brew "pandoc"
brew "pkgconf"
brew "python-lsp-server"
brew "python@3.11"
brew "qt"
brew "ripgrep"
brew "scipy"
brew "stow"
brew "tmux"
brew "trash", link: true
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "battery"
cask "kitty"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "fill-labs.dependi"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "riussi.code-stats-vscode"
vscode "rust-lang.rust-analyzer"
vscode "shengchen.vscode-checkstyle"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscjava.vscode-gradle"
